УТ_для_edt/src/InformationRegisters/смартСоставПрофильныхАссоциаций/смартСоставПрофильныхАссоциаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартСоставПрофильныхАссоциаций</name>
  <comment>#Б-2990 смарт: Лопато 09.04.2025 //Информация о профильные ассоциациях и их членов</comment>
  <resources>
    <name>ПредставительКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СайтКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ассоциация</name>
    <type>
      <types>CatalogRef.смартПрофильныеАссоциации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНеПроверятьРиски</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОтветсвтенныйЗаРиски</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>смартГенеральныйДиректор</name>
    <comment>// смарт:ММ #060 319 03.08.2020</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартБухгалтер</name>
    <comment>// смарт:ММ #060 319 03.08.2020</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОтветственныйЗаЭДО</name>
    <comment>// смарт:ММ #060 319 03.08.2020</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартСтатусКонтактныхДанныхКонтрагента</name>
    <comment>// смарт:ММ #060 319 03.08.2020</comment>
    <type>
      <types>EnumRef.смартСтатусыКонтактныхДанныхКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДатаОбновленияПоДаннымФНС</name>
    <comment>// смарт:ММ 08.10.2020 #076</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНеОбновлятьКППВноситБухгалтерия</name>
    <comment>// смарт:ММ 03.11.2020 #076</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЛизинговаяКомпания</name>
    <comment>//++ #1334 смарт: Фролов 17.04.2023 //Заявка на формирование и подписание договора из 1С </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОтправлятьВсеДокументыЧерезЭДО</name>
    <comment>#1652 смарт: Ермаков 26,06,2024 / Доработка карточки Контрагента</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПолное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/смартИнтеграцияDaData/Module.bsl
/////////////////////////////////////////////////////////////////////////////
// Модуль смартИнтеграцияDaData предназначен для 
// хранения процедур и функций, связанных с получением 
// данных из сервиса DaData
// https://dadata.ru/pricing/?product=suggestions
// Примеры:
//  - Получить данные организации по ИНН - https://dadata.ru/api/find-party/
//	- геокодирование (координаты по адресу) - https://cleaner.dadata.ru/api/v1/clean/address
//	- и подобное
// 
// Модуль создал - Шляпников, 25.09.2024
/////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет запрос к сервису DaData для поиска организации по ИНН или ОГРН
//
// Параметры:
//  ИНН - строка - ИНН или ОГРН организации, данные по которой требуется найти
//
// Возвращаемое значение:
//  ???
//
Функция ВыполнитьЗапросПолучитьДанныеОрганизацииПоИНН(ИНН) Экспорт
	
	Данные = Неопределено;
	
	АдресВнутриСайта = ПолучитьАдресСервисаПолучитьДанныеОрганизацииПоИНН();
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("query", ИНН);
	
	Результат = ВыполнитьЗапросКСервисуDaData(АдресВнутриСайта, ЗаписатьОбъектВJSON(ПараметрыЗапроса));
	
	Если Результат <> Неопределено И Результат.КодСостояния = 200 Тогда
		
		Данные = ПрочитатьОбъектИзJSON(Результат.ПолучитьТелоКакСтроку());
		
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ВыполнитьЗапросПолучитьИнформациюПоАдресу(Адрес) Экспорт
	
	Данные = Неопределено;
	
	АдресСервера = "cleaner.dadata.ru";
	АдресВнутриСайта = "api/v1/clean/address";
	
	Результат = ВыполнитьЗапросКСервисуDaData(АдресВнутриСайта, СтрШаблон("[ ""%1"" ]", Адрес),, Истина, АдресСервера);
	
	Если Результат <> Неопределено И Результат.КодСостояния = 200 Тогда
		Данные = ПрочитатьОбъектИзJSON(Результат.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет запрос к сервису DaData и возвращает результат
//
// Параметры:
//  АдресВнутриСайта - строка - адрес вызываемого метода DaData
//  Тело - строка, ДвоичныеДанные - в случае POST запроса тело запроса передаваемое в сервис
//  ВидЗапроса - строка - вид вызываемого метода GET, POST
//  ТребуетсяПередаватьСекретныйКлюч - булево - признак того, что при вызове запроса требуется передавать не только API ключ, но и секретный
//
// Возвращаемое значение:
//  HTTPОтвет - ответ полученный от сервера или неопределено, в случае неизвестного вида запроса.
//
Функция ВыполнитьЗапросКСервисуDaData(АдресВнутриСайта, Тело = Неопределено, ВидЗапроса = "POST", ТребуетсяПередаватьСекретныйКлюч = Ложь, АдресСервера = Неопределено) Экспорт
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type",  "application/json");
	Заголовки.Вставить("Accept", 		"application/json");
	Заголовки.Вставить("Authorization", СтрШаблон("Token %1", ПолучитьТокенАвторизации()));
	Если ТребуетсяПередаватьСекретныйКлюч Тогда
		Заголовки.Вставить("X-Secret", ПолучитьСекретныйКлюч());
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(АдресСервера) Тогда
		АдресСервера = ПолучитьБазовыйАдресСервиса();
	КонецЕсли;
	
	Если ВРЕГ(ВидЗапроса) = "GET" Тогда
		Возврат ВыполнитьGetЗапрос(АдресСервера, АдресВнутриСайта, , , , , , , Заголовки);
	ИначеЕсли ВРЕГ(ВидЗапроса) = "POST" Тогда
		Возврат ВыполнитьPOSTЗапрос(АдресСервера, АдресВнутриСайта, , , , , , , Заголовки, Тело);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Отправляет GET запрос на HTTP сервер
//
// Параметры:
//  АдресСервера - строка - адрес сервера(сайта)
//  АдресВнутриСайта - строка - путь к методу, внутри сайта
//  Порт - число - порт подключения, по умолчанию 80
//  Пользователь - строка - пользователь авторизации подключения
//  Пароль - строка - пароль авторизации подключения
//  Прокси - ИнтернетПрокси - если подключение идет через прокси
//  Таймаут - число - сколько ждать ответа
//  ЗащищенноеСоединение - ЗащищенноеСоединениеOpenSSL - если подключение идет по HTTPS
//  Заголовки - Соответствие - Массив заголовков запроса
//
// Возвращаемое значение:
//   HTTPОтвет - ответ полученный от сервера.
//
Функция ВыполнитьGetЗапрос(АдресСервера, АдресВнутриСайта, Порт = 80, Пользователь = "", Пароль = "", Прокси = Неопределено, Таймаут = 0, ЗащищенноеСоединение = Неопределено, Заголовки = Неопределено) Экспорт
 
    Соединение = Новый HTTPСоединение(
        АдресСервера, // сервер (хост)
        Порт, // порт, по умолчанию для http используется 80, для https 443
        Пользователь, // пользователь для доступа к серверу (если он есть)
        Пароль, // пароль для доступа к серверу (если он есть)
        Прокси, // здесь указывается прокси, если он есть
        Таймаут, // таймаут в секундах, 0 или пусто - не устанавливать
        ЗащищенноеСоединение  // защищенное соединение, если используется https
    );
 
    Запрос = Новый HTTPЗапрос(АдресВнутриСайта, Заголовки);
 
    Результат = Соединение.Получить(Запрос);
	
	Возврат Результат;
 
КонецФункции

// Отправляет POST запрос на HTTP сервер
//
// Параметры:
//  АдресСервера - строка - адрес сервера(сайта)
//  АдресВнутриСайта - строка - путь к методу, внутри сайта
//  Порт - число - порт подключения, по умолчанию 80
//  Пользователь - строка - пользователь авторизации подключения
//  Пароль - строка - пароль авторизации подключения
//  Прокси - ИнтернетПрокси - если подключение идет через прокси
//  Таймаут - число - сколько ждать ответа
//  ЗащищенноеСоединение - ЗащищенноеСоединениеOpenSSL - если подключение идет по HTTPS
//  Заголовки - Соответствие - Массив заголовков запроса
//  Тело - Строка, ДвоичныеДанные - данные передаваемые в теле запроса
//
// Возвращаемое значение:
//   HTTPОтвет - ответ полученный от сервера.
//
Функция ВыполнитьPOSTЗапрос(АдресСервера, АдресВнутриСайта, Порт = 80, Пользователь = "", Пароль = "", Прокси = Неопределено, Таймаут = 0, ЗащищенноеСоединение = Неопределено, Заголовки = Неопределено, Тело = Неопределено) Экспорт
 
    Соединение = Новый HTTPСоединение(
        АдресСервера, // сервер (хост)
        Порт, // порт, по умолчанию для http используется 80, для https 443
        Пользователь, // пользователь для доступа к серверу (если он есть)
        Пароль, // пароль для доступа к серверу (если он есть)
        Прокси, // здесь указывается прокси, если он есть
        Таймаут, // таймаут в секундах, 0 или пусто - не устанавливать
        ЗащищенноеСоединение  // защищенное соединение, если используется https
    );
 
    Запрос = Новый HTTPЗапрос(АдресВнутриСайта, Заголовки);
	
	Если НЕ Тело = Неопределено И ТипЗнч(Тело) = Тип("Строка") Тогда
		Запрос.УстановитьТелоИзСтроки(Тело);
	ИначеЕсли НЕ Тело = Неопределено И ТипЗнч(Тело) = Тип("ДвоичныеДанные") Тогда
		Запрос.УстановитьТелоИзДвоичныхДанных(Тело);
	КонецЕсли;
 
    Результат = Соединение.ОтправитьДляОбработки(Запрос);
	
	Возврат Результат;
 
КонецФункции

// Возвращает адрес сервера DaData для дальнейших запросов
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьБазовыйАдресСервиса() Экспорт
	Возврат "suggestions.dadata.ru";
КонецФункции

// Возвращает адрес сервиса DaData для получения данных об организации по ИНН или ОГРН
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьАдресСервисаПолучитьДанныеОрганизацииПоИНН() Экспорт
	Возврат "suggestions/api/4_1/rs/findById/party";
КонецФункции

// Возвращает API ключ для авторизации на сервере DaData
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьТокенАвторизации() Экспорт
	Возврат Справочники.смартПредопределенныеЗначения.Настройки.DaDataКлючAPI;
КонецФункции

// Возвращает секретный ключ для авторизации на сервере DaData
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьСекретныйКлюч() Экспорт
	Возврат Справочники.смартПредопределенныеЗначения.Настройки.DaDataСекретныйКлюч;
КонецФункции

#КонецОбласти

#Область Прочее

// Сериализует структуру, соответствие, массив в строку JSON
//
// Параметры:
//  Объект - структура, соответствие, массив
//
// Возвращаемое значение:
//  Строка - сериализованный объект в виде строки JSON.
//
Функция ЗаписатьОбъектВJSON(Объект)
	
	Запись = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "	", Истина);
    Запись.УстановитьСтроку(ПараметрыЗаписи);
    ЗаписатьJSON(Запись, Объект);
	
    Возврат Запись.Закрыть();
	
КонецФункции

// Десериализует строку JSON в соответствие
//
// Параметры:
//  Строка - Строка
//
// Возвращаемое значение:
//  Соответствие.
//
Функция ПрочитатьОбъектИзJSON(Строка)
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Строка);
	Попытка
    	Объект = ПрочитатьJSON(Чтение);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Объект = Неопределено;
		ЗаписьЖурналаРегистрации("ЧтениеJSON", УровеньЖурналаРегистрации.Ошибка, , ОписаниеОшибки,ОписаниеОшибки);
	КонецПопытки;
	
    Возврат Объект;
	
КонецФункции

#КонецОбласти

#Область ВыводДанныхНаФорму

//++ #Б-1018 смарт: Лопато 07.10.2024 //Вывод информации о контрагенте полученной из DaData  
Процедура ВывестиНаФормуИнформациюПоКонтрагенту(ИНН, Форма) Экспорт
	
	//Инициализация групп формы
	ИнициализироватьГруппыИнформацииПоКонтрагенту(Форма);	
	
	//Получение данных DaData
	ДанныеКонтрагента = смартИнтеграцияDaDataПовтИсп.ВыполнитьЗапросПолучитьДанныеОрганизацииПоИНН(ИНН);
	
	Если ТипЗнч(ДанныеКонтрагента) = Тип("Структура") 
		И ДанныеКонтрагента.Свойство("suggestions") 
		И ТипЗнч(ДанныеКонтрагента.suggestions) = Тип("Массив") Тогда
		
		КоличествоЭлементов = ДанныеКонтрагента.suggestions.Количество();
		
		Если КоличествоЭлементов > 0 Тогда
			
			ИндексДанных = Неопределено;
			
			Если КоличествоЭлементов = 1 Тогда
				
				ИндексДанных = 0;
				
			Иначе
				
				МаксимальнаяДата = Дата(1, 1, 1);
				
				Для Каждого ЭлементДанных Из ДанныеКонтрагента.suggestions Цикл
					
					Если ТипЗнч(ЭлементДанных) = Тип("Структура") 
						И ЭлементДанных.Свойство("data") Тогда
						
						ТекущийИндекс = ДанныеКонтрагента.suggestions.Найти(ЭлементДанных);
						
						//Проверка что это головная организация
						Если ЭлементДанных.data.Свойство("branch_type") 
							И ЭлементДанных.data.branch_type = "MAIN" Тогда
							
							ИндексДанных = ТекущийИндекс;
							
							Прервать;
							
						КонецЕсли;	

						//Вычисляем максимальную дату выдачи ОГРН
						Если ЭлементДанных.data.Свойство("ogrn_date") Тогда
							
							ДатаОГРН = ПреобразоватьЧислоКДатеDaData(ЭлементДанных.data.ogrn_date);
							
							Если ТипЗнч(ДатаОГРН) = Тип("Дата") 
								И ДатаОГРН > МаксимальнаяДата Тогда
								
								ИндексДанных 	 = ТекущийИндекс;
								МаксимальнаяДата = ДатаОГРН;
								
							КонецЕсли;	
							
						КонецЕсли;	
						
					КонецЕсли;
					
				КонецЦикла;	

				Если ИндексДанных = Неопределено Тогда
					
					ИндексДанных = 0;
					
				КонецЕсли;
				
			КонецЕсли;
				
			Если ИндексДанных <> Неопределено Тогда
				
				//Подготовка перечня выводимых реквизитов
				ДеревоВыводимыхПолей = ПолучитьДеревоВыводимыхПолейDaData(ДанныеКонтрагента.suggestions[ИндексДанных].data);	
				
				//Вывод информации на форму
				СформироватьНаФормеИнформациюПоКонтрагентуПоДеревуПолей(Форма, ДеревоВыводимыхПолей);

			КонецЕсли;

		КонецЕсли;
			
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-1018 смарт: Лопато 07.10.2024

//++ #Б-1018 смарт: Лопато 07.10.2024 //Вывод информации о контрагенте полученной из DaData  
Процедура ИнициализироватьГруппыИнформацииПоКонтрагенту(Форма)
	
	Если Форма.ИмяФормы = "Справочник.Партнеры.Форма.ПомощникНового" Тогда

		Форма.Элементы.Переместить(Форма.Элементы.СтраницыКомпанияЧастноеЛицо, Форма.Элементы.СтраницаПервичнаяИнформация);
		
		ГруппаИнформацияОКонтрагентеОбщая = Форма.Элементы.Найти("ГруппаИнформацияОКонтрагентеОбщая");
		
		Если ГруппаИнформацияОКонтрагентеОбщая <> Неопределено Тогда
			Форма.Элементы.Удалить(ГруппаИнформацияОКонтрагентеОбщая);
		КонецЕсли;	
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда

		Если Форма.ВидКонтрагента = "ЮрЛицоНеРезидент" Тогда
			
			ГруппаРодительИнформации = Форма.Элементы.ГруппаСтраницаИностраннойРегистрации;
			
			ГруппаРодительИнформации.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			Форма.Элементы.Переместить(Форма.Элементы.ГруппаСтранаРегистрацииНалоговыйНомер, ГруппаРодительИнформации);
			Форма.Элементы.Переместить(Форма.Элементы.ГруппаРегистрационныйНомерИННКПП, ГруппаРодительИнформации);
			
		КонецЕсли;	
		
		ГруппаИнформацияОКонтрагентеОбщаяСтраница = Форма.Элементы.Найти("ГруппаИнформацияОКонтрагентеОбщаяСтраница");
		
		Если ГруппаИнформацияОКонтрагентеОбщаяСтраница <> Неопределено Тогда
			Форма.Элементы.Удалить(ГруппаИнформацияОКонтрагентеОбщаяСтраница);
		КонецЕсли;	

		ГруппаИнформацияОКонтрагентеОбщаяСтраницаОбъединение = Форма.Элементы.Найти("ГруппаИнформацияОКонтрагентеОбщаяСтраницаОбъединение");
		
		Если ГруппаИнформацияОКонтрагентеОбщаяСтраницаОбъединение <> Неопределено Тогда
			Форма.Элементы.Удалить(ГруппаИнформацияОКонтрагентеОбщаяСтраницаОбъединение);
		КонецЕсли;	
		
	КонецЕсли;	

КонецПроцедуры //-- #Б-1018 смарт: Лопато 07.10.2024	

//++ #Б-1018 смарт: Лопато 07.10.2024 //Вывод информации о контрагенте полученной из DaData  
Функция ПолучитьДеревоВыводимыхПолейDaData(data)
	
	СписокБлоков = Новый СписокЗначений;
	
	//Состояние
	ГруппаСостояние = Новый СписокЗначений;
	
	СооответствиеСтатусовОрганизаций = Новый Соответствие;
	
	СооответствиеСтатусовОрганизаций.Вставить("ACTIVE", 	  "Действующая"); 
	СооответствиеСтатусовОрганизаций.Вставить("LIQUIDATING",  "Ликвидируется"); 
	СооответствиеСтатусовОрганизаций.Вставить("LIQUIDATED",   "Ликвидирована"); 
	СооответствиеСтатусовОрганизаций.Вставить("BANKRUPT", 	  "Банкротство"); 
	СооответствиеСтатусовОрганизаций.Вставить("REORGANIZING", "В процессе присоединения к другому юрлицу, с последующей ликвидацией"); 
	
	Если СооответствиеСтатусовОрганизаций.Получить(data.state.status) <> Неопределено Тогда
		СтатусОрганизации = СооответствиеСтатусовОрганизаций[data.state.status];
	Иначе
		СтатусОрганизации = data.state.status;	
	КонецЕсли;
	
	ГруппаСостояние.Добавить(СтатусОрганизации, 										  			  			   "Статус организации");
	ГруппаСостояние.Добавить(Формат(ПреобразоватьЧислоКДатеDaData(data.state.registration_date), "ДФ=dd.MM.yyyy"), "Дата регистрации");
	ГруппаСостояние.Добавить(Формат(ПреобразоватьЧислоКДатеDaData(data.state.actuality_date),    "ДФ=dd.MM.yyyy"), "Дата последних изменений");
	
	Если ЗначениеЗаполнено(data.state.liquidation_date) Тогда 
		ГруппаСостояние.Добавить(Формат(ПреобразоватьЧислоКДатеDaData(data.state.liquidation_date), "ДФ=dd.MM.yyyy"), "Дата ликвидации");
	КонецЕсли;	
	
	СписокБлоков.Добавить(ГруппаСостояние, "Состояние");
	
	//Информация об организации
	ГруппаИнформация = Новый СписокЗначений;
	
	ГруппаИнформация.Добавить(?(data.type = "LEGAL", 
								"Юридическое лицо", 
								"Индивидуальный предприниматель"), "Тип организации");

	ГруппаИнформация.Добавить(?(data.type = "LEGAL", 
								data.name.full_with_opf, 
								data.name.full), 				   "Полное наименование");
								
	//++ #Б-2628 смарт: Лопато 11.03.2025 //Получение и вывод информации о контрагенте из сервиса dadata.ru  
	Если data.Свойство("founders") И ТипЗнч(data.founders) = Тип("Массив") Тогда
		
		Для Каждого СтрУчредитель Из data.founders Цикл

			Если СтрУчредитель.Свойство("type") 
				И СтрУчредитель.type = "LEGAL"
				И СтрУчредитель.Свойство("name") Тогда
				
				ГруппаИнформация.Добавить(СтрУчредитель.name,   "Учредитель");
				
			ИначеЕсли СтрУчредитель.Свойство("type") 
				И СтрУчредитель.type = "PHYSICAL"
				И СтрУчредитель.Свойство("fio") 
				И ТипЗнч(СтрУчредитель.fio) = Тип("Структура")
				И СтрУчредитель.fio.Свойство("source") Тогда
				
				ГруппаИнформация.Добавить(СтрУчредитель.fio.source, "Учредитель");
				
			КонецЕсли;

			Если СтрУчредитель.Свойство("share")
				И ТипЗнч(СтрУчредитель.share) = Тип("Структура") Тогда
				
				Если СтрУчредитель.share.Свойство("type")
					И (СтрУчредитель.share.type = "PERCENT" ИЛИ СтрУчредитель.share.type = "DECIMAL")
					И СтрУчредитель.share.Свойство("value") Тогда
				
					ГруппаИнформация.Добавить(СокрЛП(СтрУчредитель.share.value)
											  + ?(СтрУчредитель.share.type = "PERCENT", "%", ""), "Доля учредителя");
					
				ИначеЕсли СтрУчредитель.share.Свойство("type")
					И СтрУчредитель.share.type = "FRACTION"
					И СтрУчредитель.share.Свойство("numerator")
					И СтрУчредитель.share.Свойство("denominator") Тогда
				
					ГруппаИнформация.Добавить(СокрЛП(СтрУчредитель.share.numerator) + "/" 
											  + СокрЛП(СтрУчредитель.share.denominator), "Доля учредителя");
				
				КонецЕсли;
										  
			КонецЕсли;
			
		КонецЦикла;	
			
	КонецЕсли;	

	Если data.Свойство("managers") И ТипЗнч(data.managers) = Тип("Массив") Тогда
		
		Для Каждого СтрРуководитель Из data.managers Цикл

			Если СтрРуководитель.Свойство("type") 
				И СтрРуководитель.type = "LEGAL"
				И СтрРуководитель.Свойство("name") Тогда
				
				ГруппаИнформация.Добавить(СтрРуководитель.name, "Руководитель");
				
			ИначеЕсли СтрРуководитель.Свойство("type") 
				И СтрРуководитель.type = "EMPLOYEE"
				И СтрРуководитель.Свойство("fio") 
				И ТипЗнч(СтрРуководитель.fio) = Тип("Структура")
				И СтрРуководитель.fio.Свойство("source")
				И СтрРуководитель.Свойство("post") Тогда
				
				ГруппаИнформация.Добавить(СтрРуководитель.fio.source, СтрРуководитель.post);
				
			КонецЕсли;
			
		КонецЦикла;	
			
	КонецЕсли;	
	//-- #Б-2628 смарт: Лопато 11.03.2025
								
	ГруппаИнформация.Добавить(data.employee_count,				   "Численность работников");
	
	Если ТипЗнч(data.address) = Тип("Структура") И data.address.Свойство("unrestricted_value") Тогда
		ГруппаИнформация.Добавить(data.address.unrestricted_value, "Адрес");
	КонецЕсли;	
	
	СписокБлоков.Добавить(ГруппаИнформация, "Информация об организации");

	//Финансовые показатели за год
	Если ТипЗнч(data.finance) = Тип("Структура") Тогда

		ГруппаФинансовыеПоказатели = Новый СписокЗначений;
		
		ГруппаФинансовыеПоказатели.Добавить(СтрЗаменить(Строка(data.finance.year), " ", ""), "Год бух. отчетности");
		
		ГруппаФинансовыеПоказатели.Добавить(Формат(data.finance.income,  "ЧДЦ=2"), "Доходы");
		ГруппаФинансовыеПоказатели.Добавить(Формат(data.finance.revenue, "ЧДЦ=2"), "Выручка");
		ГруппаФинансовыеПоказатели.Добавить(Формат(data.finance.expense, "ЧДЦ=2"), "Расходы");
		ГруппаФинансовыеПоказатели.Добавить(Формат(data.finance.debt, 	 "ЧДЦ=2"), "Недоимки по налогам");
		ГруппаФинансовыеПоказатели.Добавить(Формат(data.finance.penalty, "ЧДЦ=2"), "Налоговые штрафы");
	
		СписокБлоков.Добавить(ГруппаФинансовыеПоказатели, "Финансовые показатели за год");
		
	КонецЕсли;	
	
	Возврат СписокБлоков;
	
КонецФункции //-- #Б-1018 смарт: Лопато 07.10.2024	

//++ #Б-1018 смарт: Лопато 07.10.2024 //Вывод информации о контрагенте полученной из DaData  
Процедура СформироватьНаФормеИнформациюПоКонтрагентуПоДеревуПолей(Форма, ДеревоВыводимыхПолей)
	
	//Вывод общих групп
	Если Форма.ИмяФормы = "Справочник.Партнеры.Форма.ПомощникНового" Тогда

		ГруппаИнформацияОКонтрагентеОбщая = Форма.Элементы.Добавить("ГруппаИнформацияОКонтрагентеОбщая", Тип("ГруппаФормы"), Форма.Элементы.СтраницаПервичнаяИнформация);
		ГруппаИнформацияОКонтрагентеОбщая.Вид 				  = ВидГруппыФормы.ОбычнаяГруппа;
	    ГруппаИнформацияОКонтрагентеОбщая.Группировка 		  = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	    ГруппаИнформацияОКонтрагентеОбщая.ОтображатьЗаголовок = Ложь;

		Форма.Элементы.Переместить(Форма.Элементы.СтраницыКомпанияЧастноеЛицо, ГруппаИнформацияОКонтрагентеОбщая);
		
		//++ #Б-3128 смарт: Фролов 18.04.2025 //Вывод в 1С информации о участии клиентов в профильных ассоциациях.
		ВыбранныйИНН = Форма.ИНН;
		//-- #Б-3128 смарт: Фролов 18.04.2025
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда
		
		Если Форма.ВидКонтрагента = "ЮрЛицоНеРезидент" Тогда
			
			ГруппаРодительИнформации = Форма.Элементы.ГруппаСтраницаИностраннойРегистрации;
			
			ГруппаРодительИнформации.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			ГруппаИнформацияОКонтрагентеОбщаяСтраница = Форма.Элементы.Добавить("ГруппаИнформацияОКонтрагентеОбщаяСтраницаОбъединение", Тип("ГруппаФормы"), ГруппаРодительИнформации);
			ГруппаИнформацияОКонтрагентеОбщаяСтраница.Вид 				  = ВидГруппыФормы.ОбычнаяГруппа;
		    ГруппаИнформацияОКонтрагентеОбщаяСтраница.Группировка 		  = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		    ГруппаИнформацияОКонтрагентеОбщаяСтраница.ОтображатьЗаголовок = Ложь;

			Форма.Элементы.Переместить(Форма.Элементы.ГруппаСтранаРегистрацииНалоговыйНомер, ГруппаИнформацияОКонтрагентеОбщаяСтраница);
			Форма.Элементы.Переместить(Форма.Элементы.ГруппаРегистрационныйНомерИННКПП, ГруппаИнформацияОКонтрагентеОбщаяСтраница);
			
		Иначе	

			ГруппаРодительИнформации = Форма.Элементы.ГруппаСтраницаРоссийскогоКонтрагента;
			
		КонецЕсли;	
		
		ГруппаИнформацияОКонтрагентеОбщаяСтраница = Форма.Элементы.Добавить("ГруппаИнформацияОКонтрагентеОбщаяСтраница", Тип("ГруппаФормы"), ГруппаРодительИнформации);
		ГруппаИнформацияОКонтрагентеОбщаяСтраница.Вид 				  = ВидГруппыФормы.ОбычнаяГруппа;
	    ГруппаИнформацияОКонтрагентеОбщаяСтраница.Группировка 		  = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	    ГруппаИнформацияОКонтрагентеОбщаяСтраница.ОтображатьЗаголовок = Ложь;
		
		ГруппаИнформацияОКонтрагентеОбщая = Форма.Элементы.Добавить("ГруппаИнформацияОКонтрагентеОбщая", Тип("ГруппаФормы"), ГруппаИнформацияОКонтрагентеОбщаяСтраница);
		ГруппаИнформацияОКонтрагентеОбщая.Вид					= ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаИнформацияОКонтрагентеОбщая.Группировка			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаИнформацияОКонтрагентеОбщая.Поведение				= ПоведениеОбычнойГруппы.Всплывающая;
		ГруппаИнформацияОКонтрагентеОбщая.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.ГиперссылкаЗаголовка;
		ГруппаИнформацияОКонтрагентеОбщая.ОтображатьЗаголовок	= Истина;
		ГруппаИнформацияОКонтрагентеОбщая.ШрифтЗаголовка		= Новый Шрифт(, 11);
		ГруппаИнформацияОКонтрагентеОбщая.Заголовок				= СформироватьЗаголовокИнформацииОКонтрагенте(ДеревоВыводимыхПолей);
		ГруппаИнформацияОКонтрагентеОбщая.Скрыть();

		Если ДеревоВыводимыхПолей.Количество() > 0 
			И ДеревоВыводимыхПолей[0].Значение.Количество() > 0 Тогда
			
			Если ДеревоВыводимыхПолей[0].Значение[0].Значение = "Действующая" Тогда
				ГруппаИнформацияОКонтрагентеОбщая.ЦветТекстаЗаголовка = Новый Цвет(0, 150, 70);
			Иначе
				ГруппаИнформацияОКонтрагентеОбщая.ЦветТекстаЗаголовка = Новый Цвет(255, 0, 0);
			КонецЕсли;
			
		КонецЕсли;
		
		//++ #Б-3128 смарт: Фролов 18.04.2025 //Вывод в 1С информации о участии клиентов в профильных ассоциациях.
		ВыбранныйИНН = Форма.Объект.ИНН;
		//-- #Б-3128 смарт: Фролов 18.04.2025
		
	КонецЕсли;	
	
	//++ #Б-3128 смарт: Фролов 18.04.2025 //Вывод в 1С информации о участии клиентов в профильных ассоциациях.
	ГруппаИнформацияОКонтрагентеОбщаяВертикальная = Форма.Элементы.Добавить("ГруппаИнформацияОКонтрагентеОбщаяВертикальная", Тип("ГруппаФормы"), ГруппаИнформацияОКонтрагентеОбщая);
	ГруппаИнформацияОКонтрагентеОбщаяВертикальная.Вид 				 = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаИнформацияОКонтрагентеОбщаяВертикальная.Группировка 		 = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаИнформацияОКонтрагентеОбщаяВертикальная.ОтображатьЗаголовок = Ложь;
	
	Если НЕ ВыбранныйИНН = "" Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ассоциация.Наименование КАК АссоциацияНаименование
		|ИЗ
		|	РегистрСведений.смартСоставПрофильныхАссоциаций
		|ГДЕ
		|	ИНН = &ИНН");
		Запрос.УстановитьПараметр("ИНН", ВыбранныйИНН);
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			
			ТекстДекорации = "Клиент является участником следующих ассоциаций:";
			
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ТекстДекорации = ТекстДекорации + Символы.ПС + """" +  Выборка.АссоциацияНаименование + """";		
				
			КонецЦикла;	
			
			ГруппаИнформацияОбАссоциациях = Форма.Элементы.Добавить("ГруппаИнформацияОбАссоциациях", Тип("ГруппаФормы"), ГруппаИнформацияОКонтрагентеОбщаяВертикальная);
			ГруппаИнформацияОбАссоциациях.Вид 				 = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаИнформацияОбАссоциациях.Группировка 		 = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаИнформацияОбАссоциациях.ЦветФона 			 = Новый Цвет(204, 255, 204);
			ГруппаИнформацияОбАссоциациях.ОтображатьЗаголовок = Ложь;
			
			ГруппаИнформацияОбАссоциацияхДанные = Форма.Элементы.Добавить("ГруппаИнформацияОбАссоциацияхДанные", Тип("ГруппаФормы"), ГруппаИнформацияОбАссоциациях);
			ГруппаИнформацияОбАссоциацияхДанные.Вид 				  = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаИнформацияОбАссоциацияхДанные.Группировка 		  = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаИнформацияОбАссоциацияхДанные.ЦветФона 			  = Новый Цвет(255, 255, 255); 
			ГруппаИнформацияОбАссоциацияхДанные.ОтображатьЗаголовок = Ложь;
			
			НоваяДекорацияЗаголовок = Форма.Элементы.Добавить("ДекорацияИнформацияОбАссоциациях", Тип("ДекорацияФормы"), ГруппаИнформацияОбАссоциацияхДанные);
			НоваяДекорацияЗаголовок.Заголовок = ТекстДекорации;
			НоваяДекорацияЗаголовок.Шрифт 	  = Новый Шрифт(, 9, Истина);
			НоваяДекорацияЗаголовок.Ширина = 48;
			НоваяДекорацияЗаголовок.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
		
		КонецЕсли;
	
	КонецЕсли;
	
	//Вывод группы информации
	//ГруппаИнформацияОКонтрагенте = Форма.Элементы.Добавить("ГруппаИнформацияОКонтрагенте", Тип("ГруппаФормы"), ГруппаИнформацияОКонтрагентеОбщая); 
	ГруппаИнформацияОКонтрагенте = Форма.Элементы.Добавить("ГруппаИнформацияОКонтрагенте", Тип("ГруппаФормы"), ГруппаИнформацияОКонтрагентеОбщаяВертикальная);
	//-- #Б-3128 смарт: Фролов 18.04.2025
	ГруппаИнформацияОКонтрагенте.Вид 				 = ВидГруппыФормы.ОбычнаяГруппа;
    ГруппаИнформацияОКонтрагенте.Группировка 		 = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаИнформацияОКонтрагенте.ЦветФона 			 = Новый Цвет(251, 237, 158);
    ГруппаИнформацияОКонтрагенте.ОтображатьЗаголовок = Ложь;

	ГруппаИнформацияОКонтрагентеБлоки = Форма.Элементы.Добавить("ГруппаИнформацияОКонтрагентеБлоки", Тип("ГруппаФормы"), ГруппаИнформацияОКонтрагенте);
	ГруппаИнформацияОКонтрагентеБлоки.Вид 				  = ВидГруппыФормы.ОбычнаяГруппа;
    ГруппаИнформацияОКонтрагентеБлоки.Группировка 		  = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаИнформацияОКонтрагентеБлоки.ЦветФона 			  = Новый Цвет(255, 255, 255); 
    ГруппаИнформацияОКонтрагентеБлоки.ОтображатьЗаголовок = Ложь;
	
	//Вывод блоков информации
	Для Каждого БлокИнформации Из ДеревоВыводимыхПолей Цикл
		
		ИмяГруппыБлока = "ГруппаИнформацияОКонтрагентеБлок" + СтрЗаменить(СтрЗаменить(БлокИнформации.Представление, " ", ""), ".", "");
		
		ГруппаБлокИнформации = Форма.Элементы.Добавить(ИмяГруппыБлока, Тип("ГруппаФормы"), ГруппаИнформацияОКонтрагентеБлоки);
		ГруппаБлокИнформации.Вид 				 = ВидГруппыФормы.ОбычнаяГруппа;
	    ГруппаБлокИнформации.Группировка 		 = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	    ГруппаБлокИнформации.ОтображатьЗаголовок = Ложь;
		
		ИмяГруппыЗаголовок = ИмяГруппыБлока + "Заголовок";
		
		НоваяСтрокаИнформацииГруппаЗаголовок = Форма.Элементы.Добавить(ИмяГруппыЗаголовок, Тип("ГруппаФормы"), ГруппаБлокИнформации);
		НоваяСтрокаИнформацииГруппаЗаголовок.Вид 				 = ВидГруппыФормы.ОбычнаяГруппа;
	    НоваяСтрокаИнформацииГруппаЗаголовок.Группировка 		 = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	    НоваяСтрокаИнформацииГруппаЗаголовок.ОтображатьЗаголовок = Истина;
		
		НоваяДекорация = Форма.Элементы.Добавить(ИмяГруппыЗаголовок + "Декорация1", Тип("ДекорацияФормы"), НоваяСтрокаИнформацииГруппаЗаголовок);
		НоваяДекорация.Ширина = 0;
		
		НоваяДекорацияЗаголовок = Форма.Элементы.Добавить(ИмяГруппыЗаголовок + "ДекорацияЗаголовок", Тип("ДекорацияФормы"), НоваяСтрокаИнформацииГруппаЗаголовок);
		НоваяДекорацияЗаголовок.Заголовок = БлокИнформации.Представление;
		НоваяДекорацияЗаголовок.Шрифт 	  = Новый Шрифт(, , Истина);
		
		//++ #Б-2628 смарт: Лопато 11.03.2025 //Получение и вывод информации о контрагенте из сервиса dadata.ru  
		Счетчик = 1;
		//-- #Б-2628 смарт: Лопато 11.03.2025
		
		//Вывод строк информации
		Для Каждого СтрокаБлока Из БлокИнформации.Значение Цикл
			
			//++ #Б-2628 смарт: Лопато 11.03.2025 //Получение и вывод информации о контрагенте из сервиса dadata.ru  
			ИмяСтроки = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрокаБлока.Представление, " ", ""), ".", "") + СтрЗаменить(СокрЛП(Счетчик), Символы.НПП, ""), "-", "");
			//-- #Б-2628 смарт: Лопато 11.03.2025
			ИмяГруппыСтрокиБлока = ИмяГруппыБлока + ИмяСтроки; 
			
			НоваяСтрокаИнформацииГруппа = Форма.Элементы.Добавить(ИмяГруппыСтрокиБлока, Тип("ГруппаФормы"), ГруппаБлокИнформации);
			НоваяСтрокаИнформацииГруппа.Вид 				= ВидГруппыФормы.ОбычнаяГруппа;
		    НоваяСтрокаИнформацииГруппа.Группировка 		= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		    НоваяСтрокаИнформацииГруппа.ОтображатьЗаголовок = Ложь;
			
			НоваяДекорация = Форма.Элементы.Добавить(ИмяГруппыСтрокиБлока + "ДекорацияНачало", Тип("ДекорацияФормы"), НоваяСтрокаИнформацииГруппа);
			НоваяДекорация.АвтоМаксимальнаяШирина = Истина;
			НоваяДекорация.Ширина = 1;
			
			НоваяДекорацияЗаголовок = Форма.Элементы.Добавить(ИмяГруппыСтрокиБлока + "Имя", Тип("ДекорацияФормы"), НоваяСтрокаИнформацииГруппа);
			НоваяДекорацияЗаголовок.Заголовок = СтрокаБлока.Представление;
			НоваяДекорацияЗаголовок.Ширина = 17;
			
			НоваяДекорацияЗначение = Форма.Элементы.Добавить(ИмяГруппыСтрокиБлока + "Значение", Тип("ДекорацияФормы"), НоваяСтрокаИнформацииГруппа);
			НоваяДекорацияЗначение.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента .Право;
			НоваяДекорацияЗначение.Заголовок 			   = Строка(СтрокаБлока.Значение);
			НоваяДекорацияЗначение.Шрифт 				   = Новый Шрифт(, , Истина);
			НоваяДекорацияЗначение.Ширина 				   = 26;
			
			//++ #Б-2628 смарт: Лопато 11.03.2025 //Получение и вывод информации о контрагенте из сервиса dadata.ru  
			Если СтрНайти(ИмяСтроки, "Статусорганизации") <> 0 Тогда
			//-- #Б-2628 смарт: Лопато 11.03.2025
				Если НоваяДекорацияЗначение.Заголовок = "Действующая" Тогда
					НоваяДекорацияЗначение.ЦветТекста = Новый Цвет(0, 150, 70);
				Иначе
					НоваяДекорацияЗначение.ЦветТекста = Новый Цвет(255, 0, 0);
				КонецЕсли;	
			КонецЕсли;
			
			НоваяДекорация = Форма.Элементы.Добавить(ИмяГруппыСтрокиБлока + "ДекорацияКонец", Тип("ДекорацияФормы"), НоваяСтрокаИнформацииГруппа);
			НоваяДекорация.АвтоМаксимальнаяШирина = Истина;
			НоваяДекорация.Ширина = 1;
			
			//++ #Б-2628 смарт: Лопато 11.03.2025 //Получение и вывод информации о контрагенте из сервиса dadata.ru  
			Счетчик = Счетчик + 1;
			//-- #Б-2628 смарт: Лопато 11.03.2025
			
		КонецЦикла;	
		
	КонецЦикла;	

	//Вывод отступа
	ГруппаБлокИнформацииКонец = Форма.Элементы.Добавить("ГруппаИнформацияОКонтрагентеБлокКонец", Тип("ГруппаФормы"), ГруппаИнформацияОКонтрагентеБлоки);
	ГруппаБлокИнформацииКонец.Вид 				  = ВидГруппыФормы.ОбычнаяГруппа;
    ГруппаБлокИнформацииКонец.ОтображатьЗаголовок = Ложь;
    ГруппаБлокИнформацииКонец.Группировка 		  = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	НоваяДекорация = Форма.Элементы.Добавить("ГруппаИнформацияОКонтрагентеБлокКонецДекорация", Тип("ДекорацияФормы"), ГруппаБлокИнформацииКонец);
	НоваяДекорация.АвтоМаксимальнаяШирина = Истина;
	НоваяДекорация.Ширина = 1;
		
КонецПроцедуры //-- #Б-1018 смарт: Лопато 07.10.2024	

//++ #Б-1018 смарт: Лопато 07.10.2024 //Вывод информации о контрагенте полученной из DaData  
Функция СформироватьЗаголовокИнформацииОКонтрагенте(ДеревоВыводимыхПолей)
	
	СтрокаЗаголовка = "";

	Если ДеревоВыводимыхПолей.Количество() > 0 Тогда
		
		БлокСостояние = ДеревоВыводимыхПолей[0].Значение;
		
		Если БлокСостояние.Количество() > 0 Тогда
		
			СтатусОрганизации = БлокСостояние[0].Значение;
			СтрокаЗаголовка = СтрокаЗаголовка + "Организация " + СтатусОрганизации;
			
		КонецЕсли;
		
		Если БлокСостояние.Количество() > 1 Тогда

			ДатаРегистрации = БлокСостояние[1].Значение;
			
			Если ЗначениеЗаполнено(ДатаРегистрации) Тогда
				СтрокаЗаголовка = СтрокаЗаголовка + ", дата регистрации: " + ДатаРегистрации;
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;		

	Если ДеревоВыводимыхПолей.Количество() > 2 Тогда
		
		БлокФинансовыеПоказатели = ДеревоВыводимыхПолей[2].Значение;
		
		ДатаОтчетности = "";
		
		Если БлокФинансовыеПоказатели.Количество() > 0 Тогда
			ДатаОтчетности = БлокФинансовыеПоказатели[0].Значение;
		КонецЕсли;

		Доход = "";

		Если БлокФинансовыеПоказатели.Количество() > 1 Тогда
			Доход = БлокФинансовыеПоказатели[1].Значение;
		КонецЕсли;
			
		Если ЗначениеЗаполнено(ДатаОтчетности) 
			И ЗначениеЗаполнено(Доход) Тогда

			СтрокаЗаголовка = СтрокаЗаголовка + ", " + "доход за " 
							  + СтрЗаменить(ДатаОтчетности, " ", "") + "г.: " 
							  + Доход + " руб.";
							  
		КонецЕсли;

	КонецЕсли;	
	
	Возврат СтрокаЗаголовка; 
	
КонецФункции //-- #Б-1018 смарт: Лопато 07.10.202

//++ #Б-1018 смарт: Лопато 07.10.2024 //Вывод информации о контрагенте полученной из DaData  
Функция ПреобразоватьЧислоКДатеDaData(ДатаЧислом)

	Возврат ?(ЗначениеЗаполнено(ДатаЧислом), Дата(1970, 1, 1) + ДатаЧислом / 1000, "");
	
КонецФункции //-- #Б-1018 смарт: Лопато 07.10.2024

#КонецОбласти
